routes/web.php

});

Route::get('/blog', function () {
    return view('blog', [
        'articles' => Article::all()
    ]);
});

Route::get('/authors/{user}', function (User $user) {
    return view('blog', ['articles' => $user->articles]);
});
---
select * from `articles` order by `created_at` desc
select * from `articles` where `articles`.`author_id` = 1 and `articles`.`author_id` is not null